Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
                       + "sbeacon/lambda/getRuns",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5419749541747724086" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/878658a187063e4dfad870e9be4e49fd58ec8f23eb5632950dba4c4c8d05184c.zip" -> "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
          ~ "timestamp" = "1750304485137967200" -> "1752731620354433000"
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (50 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1347720309274839406" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304485973568000" -> "1752731619666429000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (35 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "462147669401431868" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304486047555000" -> "1752731619819767000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2388419891124688641" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304485044319000" -> "1752731618963496000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:43a83a79c2c5c19e5bcf43bd0e773a3ef65107a589cb4a3fff9cc649e8947a79" -> (known after apply)
      ~ last_modified                  = "2025-06-19T02:39:49.156+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (52 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4430933775781765454" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304485847600000" -> "1752731618982977000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8" -> (known after apply)
      ~ code_sha256                 = "EOKDSFxTuzUkgac0mJ0rzNsJU0AVsvo0Phn/TxWHt/Q=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-19T03:44:40.795+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" -> "builds/1cc9c3517ab210d130382ce9f525afe61694b5ebcafb833f8119ddd56c2ac67b.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 23629604 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250619023050292900000004/builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "cbb8e65f657743e88e61ae366e4323cd-5" -> (known after apply)
      ~ id                            = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" -> (known after apply)
      ~ key                           = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" -> "builds/1cc9c3517ab210d130382ce9f525afe61694b5ebcafb833f8119ddd56c2ac67b.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" -> "builds/1cc9c3517ab210d130382ce9f525afe61694b5ebcafb833f8119ddd56c2ac67b.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/1cc9c3517ab210d130382ce9f525afe61694b5ebcafb833f8119ddd56c2ac67b.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/1cc9c3517ab210d130382ce9f525afe61694b5ebcafb833f8119ddd56c2ac67b.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7702039469218022234" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" -> "builds/1cc9c3517ab210d130382ce9f525afe61694b5ebcafb833f8119ddd56c2ac67b.zip"
          ~ "timestamp" = "1750304496717553000" -> "1752731633466049000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5" -> (known after apply)
      ~ code_sha256                 = "xv7iHn4X2niBLeSEbPjnqbdewX+Uv/2yPTHTiRwIQ7s=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-19T02:31:55.081+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" -> "builds/a56d2cda02d28f36ad08eba0b93b48a236db5bc85b377f60e42375fa3d3bb92b.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 38186 -> (known after apply)
      ~ version                     = "5" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250619023050292900000004/builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "76945de49ac64d613a9bc6b2b3211652" -> (known after apply)
      ~ id                            = "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" -> (known after apply)
      ~ key                           = "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" -> "builds/a56d2cda02d28f36ad08eba0b93b48a236db5bc85b377f60e42375fa3d3bb92b.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" -> "builds/a56d2cda02d28f36ad08eba0b93b48a236db5bc85b377f60e42375fa3d3bb92b.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a56d2cda02d28f36ad08eba0b93b48a236db5bc85b377f60e42375fa3d3bb92b.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a56d2cda02d28f36ad08eba0b93b48a236db5bc85b377f60e42375fa3d3bb92b.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2724191559089834873" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" -> "builds/a56d2cda02d28f36ad08eba0b93b48a236db5bc85b377f60e42375fa3d3bb92b.zip"
          ~ "timestamp" = "1750304484746220200" -> "1752731622082591000"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2222324627247828874" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304484883471000" -> "1752731619227623000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/f1a38eccba47d2bd1023f1983c3f584b5b44c41010a0ed2c712070404765931a.zip" -> "builds/b740d1033c5157e1fc4335407fdc9cf6e919fc6834ed7a9ce7d453ed2f503233.zip"
        id                             = "pgxflow-backend-dbsnp"
      ~ last_modified                  = "2025-06-19T04:05:57.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/dbsnp",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/b740d1033c5157e1fc4335407fdc9cf6e919fc6834ed7a9ce7d453ed2f503233.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/b740d1033c5157e1fc4335407fdc9cf6e919fc6834ed7a9ce7d453ed2f503233.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5136565656757208500" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f1a38eccba47d2bd1023f1983c3f584b5b44c41010a0ed2c712070404765931a.zip" -> "builds/b740d1033c5157e1fc4335407fdc9cf6e919fc6834ed7a9ce7d453ed2f503233.zip"
          ~ "timestamp" = "1750304497641901000" -> "1752731634064081000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-lookup-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7838893250866447632" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304497633950000" -> "1752731633813588000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7426655328903675051" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304497629376000" -> "1752731633955621000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-initLookup:pgxflow-backend-initLookup-0"
        name        = "pgxflow-backend-initLookup-0"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = "s3:GetObject"
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:s3:::pgxflow-backend-references-20250619023037268600000002/*",
                            "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/project-files/*",
                        ]
                    },
                  ~ {
                      ~ Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users" -> [
                          + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users",
                          + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/pgxflow-references",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "dynamodb:UpdateItem",
                            "dynamodb:PutItem",
                            "dynamodb:GetItem",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/33ca5d9bf1f90b78aa601543d8713042e872e5f98f0d4d91dc9d2b2edea6d2fb.zip" -> "builds/3b962a321bdf8e5e4a8e21b4841581e0dd2ab640971e2acac27ab3999fdb95e8.zip"
        id                             = "pgxflow-backend-initLookup"
      ~ last_modified                  = "2025-06-19T04:06:08.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PGXFLOW_REFERENCES_TABLE" = "pgxflow-references"
                # (10 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/initLookup",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/3b962a321bdf8e5e4a8e21b4841581e0dd2ab640971e2acac27ab3999fdb95e8.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/3b962a321bdf8e5e4a8e21b4841581e0dd2ab640971e2acac27ab3999fdb95e8.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "979012218675586596" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/33ca5d9bf1f90b78aa601543d8713042e872e5f98f0d4d91dc9d2b2edea6d2fb.zip" -> "builds/3b962a321bdf8e5e4a8e21b4841581e0dd2ab640971e2acac27ab3999fdb95e8.zip"
          ~ "timestamp" = "1750304497786314000" -> "1752731634148166800"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/53222f8ee608c84de7549e1709f1b8780e1237d60f44caf8c9a02f196239ecd7.zip" -> "builds/04eb50d84cafb8a2b46d74d30507df54e1dc449edbde860b9d8c4073d8c5b230.zip"
        id                             = "pgxflow-backend-lookup"
      ~ last_modified                  = "2025-06-19T04:05:47.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/lookup",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/04eb50d84cafb8a2b46d74d30507df54e1dc449edbde860b9d8c4073d8c5b230.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/04eb50d84cafb8a2b46d74d30507df54e1dc449edbde860b9d8c4073d8c5b230.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6222069017305715740" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/53222f8ee608c84de7549e1709f1b8780e1237d60f44caf8c9a02f196239ecd7.zip" -> "builds/04eb50d84cafb8a2b46d74d30507df54e1dc449edbde860b9d8c4073d8c5b230.zip"
          ~ "timestamp" = "1750304497787231000" -> "1752731633986572000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/06e182ce701efe79e03103c3bcdacdc3a6ebdcefeb10c45631c4860ce7777488.zip" -> "builds/725b2562166dbf31a256a1aa152f5e4119a08f195a8effd01dd97246da888268.zip"
        id                             = "pgxflow-backend-lookup-sendJobEmail"
      ~ last_modified                  = "2025-06-19T05:41:56.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/sendJobEmail",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/725b2562166dbf31a256a1aa152f5e4119a08f195a8effd01dd97246da888268.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/725b2562166dbf31a256a1aa152f5e4119a08f195a8effd01dd97246da888268.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "346939941039000603" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/06e182ce701efe79e03103c3bcdacdc3a6ebdcefeb10c45631c4860ce7777488.zip" -> "builds/725b2562166dbf31a256a1aa152f5e4119a08f195a8effd01dd97246da888268.zip"
          ~ "timestamp" = "1750304497856439200" -> "1752731633869569000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/23c1c917d91841728fbe19181191ba4ce10dac51e9255b6cadb09864299463dc.zip" -> "builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.zip"
        id                             = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ last_modified                  = "2025-06-19T04:04:44.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1961319673397733416" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/23c1c917d91841728fbe19181191ba4ce10dac51e9255b6cadb09864299463dc.zip" -> "builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.zip"
          ~ "timestamp" = "1750304497653606000" -> "1752731633898325000"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:91fc437d682c057df69a6c0aa57fa42251e6519abcd6aa82a6319af70fa5cf13438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:91fc437d682c057df69a6c0aa57fa42251e6519abcd6aa82a6319af70fa5cf13" -> (known after apply)
        name         = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ repo_digest  = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:a9aa34fd5285cf815da55e8ee266b4118d1a3e3bcdd665c83a998299ea7deae8" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "a92762352956ff5a04e826d235c3e2ece5dd866d" -> "898b2ef2ee27959179e1f7a2113b5125ac720840"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/pipeline_pharmcat/lambda/pharmcat" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/pharmcat"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:a9aa34fd5285cf815da55e8ee266b4118d1a3e3bcdd665c83a998299ea7deae8" -> (known after apply)
        name                 = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ sha256_digest        = "sha256:a9aa34fd5285cf815da55e8ee266b4118d1a3e3bcdd665c83a998299ea7deae8" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "a92762352956ff5a04e826d235c3e2ece5dd866d" -> "898b2ef2ee27959179e1f7a2113b5125ac720840"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:4c27d528f5bf09e95342cbf27250df4f4c2d5c8762470d605c6455b786bccc00438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:4c27d528f5bf09e95342cbf27250df4f4c2d5c8762470d605c6455b786bccc00" -> (known after apply)
        name         = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ repo_digest  = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers@sha256:14e37446b54e8da5dc615143bdc729b848eabe9f89506d947b20a80dbf9926ce" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "2cb101214820a5c13e2fe43f9438e6820d533d87" -> "d2fa456f0d1766f5bcb59cf614d6613edfc295da"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/pipeline_pharmcat/lambda/preprocessor" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/preprocessor"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:14e37446b54e8da5dc615143bdc729b848eabe9f89506d947b20a80dbf9926ce" -> (known after apply)
        name                 = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ sha256_digest        = "sha256:14e37446b54e8da5dc615143bdc729b848eabe9f89506d947b20a80dbf9926ce" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "2cb101214820a5c13e2fe43f9438e6820d533d87" -> "d2fa456f0d1766f5bcb59cf614d6613edfc295da"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5579737667269875883" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304498170984000" -> "1752731634333592000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3797562833654865178" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304498037343000" -> "1752731634229451000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-initPharmcat:pgxflow-backend-initPharmcat-0"
        name        = "pgxflow-backend-initPharmcat-0"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = "s3:GetObject"
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/project-files/*"
                    },
                  ~ {
                      ~ Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users" -> [
                          + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users",
                          + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/pgxflow-references",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "dynamodb:UpdateItem",
                            "dynamodb:PutItem",
                            "dynamodb:GetItem",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/d69bde856056aeaab5b0658ac300deb9a8325cf61a009d888b7b1644240af68e.zip" -> "builds/f624e087a9adeb61f30f12719dda195ef2bafbcd7ffa959ce2d4ae3450aa660d.zip"
        id                             = "pgxflow-backend-initPharmcat"
      ~ last_modified                  = "2025-06-19T04:06:03.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_PGXFLOW_REFERENCES_TABLE"      = "pgxflow-references"
                # (8 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/initPharmcat",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f624e087a9adeb61f30f12719dda195ef2bafbcd7ffa959ce2d4ae3450aa660d.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f624e087a9adeb61f30f12719dda195ef2bafbcd7ffa959ce2d4ae3450aa660d.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4537767296425692701" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/d69bde856056aeaab5b0658ac300deb9a8325cf61a009d888b7b1644240af68e.zip" -> "builds/f624e087a9adeb61f30f12719dda195ef2bafbcd7ffa959ce2d4ae3450aa660d.zip"
          ~ "timestamp" = "1750304498232101000" -> "1752731634470491800"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat"
      ~ image_uri                      = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:a9aa34fd5285cf815da55e8ee266b4118d1a3e3bcdd665c83a998299ea7deae8" -> (known after apply)
      ~ last_modified                  = "2025-06-19T02:37:52.750+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/7ebc170531557acc8cb79c137b1897ec1fbed68016f6c6d5d0c9e5dfa416ca47.zip" -> "builds/1f677891b48ace69e4786e26b02d9661cd5cc377d9d42d6b8c371b54c2cbd061.zip"
        id                             = "pgxflow-backend-postprocessor"
      ~ last_modified                  = "2025-06-19T04:05:52.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_libraries_layer:2",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/postprocessor",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/1f677891b48ace69e4786e26b02d9661cd5cc377d9d42d6b8c371b54c2cbd061.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/1f677891b48ace69e4786e26b02d9661cd5cc377d9d42d6b8c371b54c2cbd061.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5651350644769448786" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/7ebc170531557acc8cb79c137b1897ec1fbed68016f6c6d5d0c9e5dfa416ca47.zip" -> "builds/1f677891b48ace69e4786e26b02d9661cd5cc377d9d42d6b8c371b54c2cbd061.zip"
          ~ "timestamp" = "1750304497926670000" -> "1752731634143490000"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-preprocessor"
      ~ image_uri                      = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers@sha256:14e37446b54e8da5dc615143bdc729b848eabe9f89506d947b20a80dbf9926ce" -> (known after apply)
      ~ last_modified                  = "2025-06-19T02:40:09.817+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/4e5110a4935f23d273794b201824a97911b3ea269bd57208a7cdb09d3180acd1.zip" -> "builds/50e51e6fd6cd0390dc575643043f2399289d1e995c0e48302f5a50335b0fc2ba.zip"
        id                             = "pgxflow-backend-pharmcat-sendJobEmail"
      ~ last_modified                  = "2025-06-19T05:41:56.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/sendJobEmail",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/50e51e6fd6cd0390dc575643043f2399289d1e995c0e48302f5a50335b0fc2ba.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/50e51e6fd6cd0390dc575643043f2399289d1e995c0e48302f5a50335b0fc2ba.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5703802957691230897" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/4e5110a4935f23d273794b201824a97911b3ea269bd57208a7cdb09d3180acd1.zip" -> "builds/50e51e6fd6cd0390dc575643043f2399289d1e995c0e48302f5a50335b0fc2ba.zip"
          ~ "timestamp" = "1750304498030924000" -> "1752731634444717800"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/87d47c3a7a19e48e88e0ad96574f23db04eac6b3b01ba350d7b96e2966fa3be8.zip" -> "builds/b2aa315848da684e512f08a084330d1fe4fc5310bc70674df2bd154c68a31c04.zip"
        id                             = "pgxflow-backend-pharmcat-updateReferenceFiles"
      ~ last_modified                  = "2025-06-19T04:04:49.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/b2aa315848da684e512f08a084330d1fe4fc5310bc70674df2bd154c68a31c04.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/b2aa315848da684e512f08a084330d1fe4fc5310bc70674df2bd154c68a31c04.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1819454515673216719" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/87d47c3a7a19e48e88e0ad96574f23db04eac6b3b01ba350d7b96e2966fa3be8.zip" -> "builds/b2aa315848da684e512f08a084330d1fe4fc5310bc70674df2bd154c68a31c04.zip"
          ~ "timestamp" = "1750304498078191000" -> "1752731634349989000"
        }
    }

Plan: 130 to add, 48 to change, 66 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: uat01-plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "uat01-plan.out"
✅ Terraform plan created successfully: uat01-plan.out
ℹ️  Plan summary:

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.pgxflow[0].archive_file.binaries_layer has changed
  ~ resource "archive_file" "binaries_layer" {
        id                  = "945d3ec304a584a4ff76a514bb8b0c4dbac641bb"
      ~ output_base64sha256 = "27+amzZcf8nh6vzoVhByU3ZUHTp6QKYPX1lwyF2nvYk=" -> "FN4qmmsO3+wBsJ8z9CdvCYRzM+hSoOez+60/RBYEVjA="
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ ============================================================
✅ Atlantis plan completed successfully for uat01!

Thank you for using Atlantis Schema Deploy
© June, 2025 GXC Consortium
✅ Main execution completed successfully
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ Script completed successfully
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gxc-uat01
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-gxc.xapiens.id/lock?id=GSI-Xapiens-CSIRO%252FBGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gxc-uat01
  ```

**Note: Objects have changed outside of Terraform**
Plan: 130 to add, 48 to change, 66 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```